In [5]:
import numpy as np
import pandas as pd

<b>1. Read data from csv.</b>

In [6]:
df = pd.read_csv('igrzyska_list_7.csv')
df['economical_opinion']

0      4.000000
1      3.333333
2      2.333333
3      4.000000
4      3.000000
         ...
955    3.666667
956    2.666667
957    2.666667
958    2.666667
959    3.333333
Name: economical_opinion, Length: 960, dtype: float64

<b>2. Normalize values in columns q67s1, q67s2, q67s3 and q67s4.</b>

In [10]:
df["q67s1"]=((df["q67s1"]-df["q67s1"].min())
                        /(df["q67s1"].max()-df["q67s1"].min()))

df["q67s2"]=((df["q67s2"]-df["q67s2"].min())
                        /(df["q67s2"].max()-df["q67s2"].min()))

df["q67s3"]=((df["q67s3"]-df["q67s3"].min())
                        /(df["q67s3"].max()-df["q67s3"].min()))

df["q67s4"]=((df["q67s4"]-df["q67s4"].min())
                        /(df["q67s4"].max()-df["q67s4"].min()))

df[["q67s1", "q67s2", "q67s3", "q67s4"]]

        q67s1     q67s2     q67s3     q67s4
0    0.428571  0.428571  0.428571  0.428571
1    0.000000  0.000000  0.000000  0.142857
2    1.000000  1.000000  1.000000  1.000000
3    0.000000  0.000000  0.000000  0.000000
4    0.142857  0.142857  0.142857  0.142857
..        ...       ...       ...       ...
955  0.857143  0.857143  0.857143  0.857143
956  0.142857  0.142857  0.142857  0.142857
957  0.000000  0.000000  0.285714  0.428571
958  0.000000  0.000000  0.000000  0.000000
959  0.142857  0.142857  0.142857  0.285714

[960 rows x 4 columns]

<b>3. Replace NaNs with the most frequent value.</b>

In [21]:
df.loc[df['q13'].isna(), 'q13'] = df['q13'].mode()

print(f"q13 column mode: \t {df['q13'].mode()}",
      f"\nNumber of NaN values: \t {df[df['q13'].isna()]['q13'].count()}")

q13 column mode: 	 0    6.0
dtype: float64
Number of NaN values: 	 0

<b>4. Create leap_year column based on respondent birth date.</b>

In [26]:
df['year_to_datetime'] = pd.to_datetime(df['URODZONY'], format='%Y')
df['leap_year'] = df['year_to_datetime'].dt.is_leap_year
df[['URODZONY', 'year_to_datetime', 'leap_year']]

     URODZONY year_to_datetime  leap_year
0        1940       1940-01-01       True
1        1943       1943-01-01      False
2        1936       1936-01-01       True
3        1948       1948-01-01       True
4        1994       1994-01-01      False
..        ...              ...        ...
955      1991       1991-01-01      False
956      1964       1964-01-01       True
957      1975       1975-01-01      False
958      1984       1984-01-01       True
959      1944       1944-01-01       True

[960 rows x 3 columns]

<b>5. Series' Accessors usage example.</b>

In [31]:
df['woj'].astype('category').cat.categories()

TypeError: 'Int64Index' object is not callable

<b>6. Create 5 equal birth date groups and a new column assigning respondent to one of these groups.</b>